app/views/shopping_list/index.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      <% @recipe_foods.each do |r| %>
        <% if @food.include?(r.food) %>