app/views/recipes/public.html.erb

          <span class="card-text fw-bold"
            >Total food items: <%= recipe.recipe_foods.length %> </span
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]