app/views/recipes/show.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
---
    <tbody>
      <% @recipe.recipe_foods.each do |recipeFood|%>