app/views/recipe_foods/new.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
---
    <%= f.label :food, class:"form-label" %><br>
    <%= f.select :food_id, current_user.foods.collect {|food| [food.name, food.id]},{ include_blank: true} , class:"form-select" %><br>