app/controllers/foods_controller.rb

  def index
    @foods = Food.all
---
SELECT "foods".* FROM "foods"