app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
---
  def index
    @foods = Food.where(user_id: current_user.id)

INSERT INTO "foods" ("name", "measurement_unit", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "yaseer"], ["measurement_unit", "grmas"], ["price", "12.0"], ["created_at", "2022-03-19 11:24:52.269343"], ["updated_at", "2022-03-19 11:24:52.269343"], ["user_id", 1]]
---
  def create
    @food = current_user.foods.new(food_params)
    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food = Food.find(params[:id])
    authorize! :destroy, @food
    if @food.delete