app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.where(user_id: current_user.id)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    if @recipe.save
---
INSERT INTO "recipes" ("name", "preperation_time", "cooking_time", "description", "public", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]

  def public
    @recipes = Recipe.where(public: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]