app/controllers/recipe_foods_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @recipe = Recipe.find(params[:recipe_id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "created_at", "updated_at", "recipe_id", "food_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 4], ["created_at", "2022-03-19 13:20:43.737518"], ["updated_at", "2022-03-19 13:20:43.737518"], ["recipe_id", 1], ["food_id", 4]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_food = @recipe.recipe_foods.create(recipe_foods_params)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @recipe_food = RecipeFood.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "recipe_foods" SET "quantity" = $1, "updated_at" = $2 WHERE "recipe_foods"."id" = $3  [["quantity", 6], ["updated_at", "2022-03-19 13:43:35.960441"], ["id", 2]]
---
  def update
    @recipe_food = RecipeFood.find(params[:id])
    if @recipe_food.update(update_params)

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe_food = RecipeFood.find(params[:id])
    @recipe_food.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_recipe
    @recipe = Recipe.find(params[:id])