app/controllers/shopping_list_controller.rb

    def index
      @recipe = Recipe.find(params[:recipe_id])
      @recipe_foods = RecipeFood.all
      @food = Food.all
      @total_price = sum(@recipe.recipe_foods.includes([:food]))
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 4]]